B2BGITVersion/AVAILABILITYAPI/HotelFutureRates.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.juniper.es/webservice/2007/">
  <soapenv:Header/>
  <soapenv:Body>
    <HotelFutureRates>
      <HotelFutureRatesRQ Version="1.1" Language="en">
        <Login Email="user@mydomain.com" Password="pass"/>
        <HotelFutureRatesRequest>
          <SearchSegmentsHotelFutureRates>
            <SearchSegmentHotels Start="2019-11-02" End="2019-11-03"/>
            <CountryOfResidence>ES</CountryOfResidence>
          </SearchSegmentsHotelFutureRates>
        </HotelFutureRatesRequest>
      </HotelFutureRatesRQ>
    </HotelFutureRates>
  </soapenv:Body>
</soapenv:Envelope>
